/**
 * Решить задачу 2, без использования циклов. Использовав рекурсию.
 *
 * Задание 2
 * Написать функцию drawRectangle которая рисует в консоли прямоугольник из символов '+'
 * Аргументы функции: ширина прямугольника в символах, высота прямоугольника в символах
 * Например 3 на 2 Вывод программы: + + + + + +
 */
public class Solution6 {

    static int i = 0;

    public static void main(String[] args) {

        drawRectangle(10, 4);
    }

    public static void drawRectangle(int x, int y){ // х - по горизонталі, y - по вертикалі

        if ((x == 0) && (y == 1)) return; //
        if (x != 0){ // рухаємось по рядку поки не добігаєм його кінця
            i++; // збільшуєм лічильник пройдених символів у рядку (в кінці зрівнюється з шириною рядка)
            System.out.print("x ");
            drawRectangle(x-1, y); // пересуваємось на 1 позицію в рядку
        } else { // інакше (при досягненні кінця рядка) перескакуєм на наступний рядок
            System.out.println(); // перескакуєм на наступний рядок
            x = i; // зберігаєм ширину рядка для майбутнього проходження
            i = 0; // обнуляємо лічильник пройдених символів у рядку
            drawRectangle(x, y-1); // зменшуєм кількість рядків на 1
        }
    }


}
